[
  {
    "template": {
      "data": {
        "title": "",
        "author": "",
        "author_slug": "",
        "date": "",
        "pull_quote": "",
        "layout": "../_single.jade"
      },
      "content": "",
      "id": null
    },
    "name": "announcements",
    "content": [
      {
        "data": {
          "title": "",
          "author": "",
          "author_slug": "",
          "date": "",
          "pull_quote": "",
          "layout": "../_single.jade"
        },
        "content": "",
        "id": "announcements/_template.md"
      },
      {
        "data": {
          "title": "Carrot.is: API",
          "author": "Tony",
          "author_slug": "tony",
          "date": "5/2/2013",
          "layout": "../_single.jade"
        },
        "content": "Imagine a series of gridded laser lights projected ahead of you, flying past your head with a series of beeps and zaps. A voice pounds in your ear, coarse and determined: \"The year is 2013, computers communicate via Application Programming Interface protocols. It is with these API protocols that all information on the internet is transmitted and shared.\"\n\n17 years ago, that's how I would have introduced Carrot's new API (_and the video would have been available on VHS_). Today, I'll just be using a blog post:\n\nCarrot developers aren't strangers to working with apps and data.  So, when it came to creating something for Carrot, it only made sense that we convert our properties to run off a dynamic database of all things Carrot. We work daily with Facebook, Twitter, Instagram, Tumblr, and many more APIs; the next logical step was to build our own. Our API not only powers content for our (new site)[http://carrot.is], but will scale with our growth and provide back-end support for all of our future Carrot endeavors. The API is semi-RESTful with a custom OAuth-ish login, built from scratch by our team. It verifies Carrots with their Facebook profile, streamlining the process and more easily enabling all our staff to stay connected with each other. Besides providing us with some fun and helpful endpoints, it also helps with the onboarding of new Carrots, tracking the internal structure of Carrot, and acts as a platform for testing and launching new ideas.\n\nThe development of the API was a fun endeavor and we taught ourselves a lot about building a truly scalable application. Once the core framework was in place, we often found it already meeting our growing needs with little to no updates from us. It's a rewarding experience when a specific need pops up and the API already has an endpoint ready to provide the exact data.\n\nWe'll be building out the API through the next few years and we already have plans for some awesome apps that will be running off its data. I also plan to write up some documentation for its use, and can't wait to see what our future developers will be able to do with all the information about the company at their fingertips.\n\nWe're done here.\n\n* * *\n\nHere's a sneak peek at what we can see on our end:\n\n![Alt text](http://content.screencast.com/users/Antonelli/folders/Jing/media/ee5c509d-e781-4a01-bab1-0110737e4b04/00000164.png)\n\n![Alt text](http://content.screencast.com/users/Antonelli/folders/Jing/media/5dcbbf65-3dbc-4f15-8f99-f1958ea69195/00000165.png)\n",
        "id": "announcements/carrot_is_api.md"
      },
      {
        "data": {
          "title": "Carrot.is: Roots",
          "author": "Jeff",
          "author_slug": "jeff",
          "date": "6/18/2013",
          "layout": "../_single.jade"
        },
        "content": "It's no secret that the redesign of carrot.is is built on top of [roots](http://roots.cx), a framework that I've been working on both at carrot and on my own time for nearly a year at this point. In this post, I want to discuss the decision to use roots, as well as some of the backstory and the most important features we took advantage of in order to get carrot.is operating smoothly.\n\nI started working on roots at Carrot more than a year ago because I was fed up with writing the same css patterns over and over. As part of working at an agency, developers are exposed to a wide variety of different work in different styles that we run through very quickly, so we can't create a UI library, or code the css for a page once then recycle. Every project has entirely different requirements, and must be coded from scratch. In this circumstance, the only way to speed things up is to abstract higher level patterns we see when writing css, because anything too specific could not be consistent across all projects. Things like transforming lists to be inline, writing gradients, darkening a button on hover, setting the width and height on an element - these are all things that could be abbreviated.\n\nUsing [sass](http://sass-lang.com/), I started writing a small library that created abberviations for a bunch of these common patterns. Initially, I coupled it with [stasis](http://stasis.me/) for building smaller static sites, made a gem for [rails](http://rubyonrails.org/), and found that it saved us tons of time and made writing css a lot easier. After using this early prototype for a while, I started wanting more, both out of the css library and the static site builder. I wanted the power to read values off a parent element and set them dynamically from a mixin. I wanted the webpage to reload every time I made a change to a file. I wanted a cleaner, simpler project structure. So the process of building roots began.\n\nThe first version was shipped a few months ago, and got [generally good reception](https://news.ycombinator.com/item?id=4916266), which was really exciting. Since I have been using roots, I have fallen more and more for static sites. They are so incredibly fast and straightforward, and more dynamic content can easily be loaded in with javascript.\n\nI wanted the new carrot site to be static, but the fact remained that there would be a lot of content that changed frequently on the site, and eventually we would want other people to be able to change it. This led to the development of dynamic content in roots. Objects like staff members, press posts, capabilities, etc are all collections of custom objects that can grow and shrink. They can be treated somewhat like blog posts, except they don't only have to have words, or be ordered by date, and they can have any number of custom properties. This is what I call [dynamic content](http://roots.cx/docs/#dynamic), and it's a way of organizing dynamic collections of objects that share a common parent. Once this feature was added to roots, it seemed feasible that it could fit with the carrot site.\n\nWhile we worked on the website, [Tony](http://carrot.is/tony) was finishing off a really excellent API for all our carrot staff information. To integrate this into the site would usually mean hitting the api with an ajax call then building a huge string of html manually inside the javascript in order to render each staff member. But luckily, we had just built [precompiled templates](http://roots.cx/docs/#precompile) into roots, which meant it would be easy for us to write the templates in our usual [jade](http://jade-lang.com/), and have them render seamlessly from javascript.\n\nThroughout the process of building the new carrot site, it seems like we squeezed every feature we could out of roots. It certainly helped to have had built roots in-house, so we knew if anything needed fixing or an additional feature was required, no panic was necessary. But now that [the site is live](http://carrot.is), it proves to us that roots is entirely ready for tackling large production apps. I'd encourage you to give it a try for your next site. Roots is [free and open source](https://github.com/jenius/roots), there are a number of brand new [tutorials](http://roots.cx/#tutorials) up, and we will be open-sourcing a number of components that went into building the site as well over the next couple weeks as well.\n",
        "id": "announcements/carrot_is_roots.md"
      },
      {
        "data": {
          "title": "Carrot.is: Speed",
          "author": "Jeff",
          "author_slug": "jeff",
          "date": "6/18/2013",
          "layout": "../_single.jade"
        },
        "content": "Page load speed is pretty high on our priorities list over here at carrot, and so is responsive design, as you could see by our [last post](#). But the two don't always live in perfect harmony. While [Roots'](http://roots.cx) minified code paired with [cloudflare](https://www.cloudflare.com/) and a brilliant [nginx](http://nginx.org/) setup by [kyle](http://carrot.is/kyle) allowed us to push the initial page load and html delivery to the maximum possible speed, image assets can quickly become an issue, especially when building for retina at any screen size.\n\nAlthough tools like [imageoptim](http://imageoptim.com/) and  [imagealpha](http://pngmini.com/) help us to squeeze every drop out of our images, we knew from the beginning that we would have a fairly image-heavy site, and our load time would probably suffer because of this. The big move we made in order to mitigate this issue was to using svg images, which was one of the best decisions we made while building this site. The carrot brand already utilizes a flat and simple illustration style, and it was easy for us to adapt the graphics for the new site into vectors. On top of this, svg images provide us with two gigantic benefits: first, they are infinitely scalable, and automatically retina (or higher), and second, the file size after begin gzipped is tiny. Fairly complex svg images from our site clock in around 50kb (already small) and are squeezed down easily below 20kb by gzip, which is especially effective on xml (which is how svg images are encoded) as we can see by the 50%+ reduction of image size. It's also worth mentioning [svgo](https://github.com/svg/svgo), a fantastic tool that allowed us to squeeze even more out of the svg source.\n\nOptimizations such as these have allowed us to snag upwards of 95/100 on the google page speed rankings, and the only reason we were docked those 5 points was because of google maps' resource loading. Ah, the irony.\n\nIt's important to remember that a great product is always a balance between good looks and performance. By having our design team work closesly with developers, we were able to come up with creative solutions that not only allowed us to have gorgeous, resolution-independent animated graphics all over our site, but also have the page load consistently in less than a half second. That's how we do it here at carrot.\n",
        "id": "announcements/carrot_is_speed.md"
      },
      {
        "data": {
          "title": "Ever Want to Be a Carrot?",
          "author": "Kyle",
          "author_slug": "kyle",
          "date": "8/16/2010",
          "layout": "../_single.jade"
        },
        "content": "We're sending out a call for developers.  And this isn't some mamby-pamby \"after a month of fooling around we'll maybe get back to you\" kind of call...this is a \"we are going to hire you within two weeks\" type of deal.\n\nSick of slugging away at your job?  Want to work with fun people, a french bulldog and a voice-activated R2D2? How about tackling brands like Disney, Ford and the NFL?  Come join a tech team of hilarious, wicked smart people.\n\n_Please note – we're ONLY HIRING DEVELOPERS AT THIS TIME_\n\n**Developer / Engineer / Hacker**  \n\nIf your idea of fun is hacking on API's and learning a new programming language then this is the job for you. Carrot Creative is looking for a Web Developer to add to the team. Your tasks will include:\n\n- Never getting anyone coffee\n- No monotonous data-entry\n- Contributing equally to an already talented staff\n- Challenging yourself\n- Importing / Exporting\n\n**Job Requirements:**  \n\nA strong understanding of Object-Oriented Programming and MVC paradigms. Applicant should be cross-functional, comfortable with server-side and client-side work. Candidate should also have experience with interacting with third-party API's and web-services. Demonstrated familiarity and application of open-source tools is a major plus.\n\nWe are primarily a PHP shop, so competency is vital, but we also allow for any additional language of choice as long as Applicant is properly skilled.\n\nTechnologies we use (experience beneficial):\n\n- Git\n- HTML5, CSS3, jQuery, and node.js\n- AWS, EC2\n- Unix\n- mySQL, MongoDB\n- WordPress, Buddypress, Zend Framework, Expression Engine, and Code Ignitor\n- Oxford Commas\n\nAnd for our third and final list, I will include some items that would really help your chances!\n\n- Outgoing personality\n- Must be willing to be Carrot branded with their Twitter account\n- Photoshop experience\n- Existing open-source contributions\n- A sharp haircut\n- The ability to do a flawless moonwalk\n\nPlease send resumes, portfolio/work (and preferably not malicious code) to:\n\n[careers@carrotcreative.com](maito:carreers@carrotcreative.com)\n\nIf you REALLY want to impress us, play the games at [http://carrotcreative.com/careers](http://carrotcreative.com/careers) (you'll get major bonus points, as well as give you an opportunity to snapshot your personality, instead of just a bunch of words).\n\nBonus points for including your [Git Hub](http://github.com/) url along with your resume.\n",
        "id": "announcements/ever_want_to_be_a_carrot.md"
      }
    ]
  },
  {
    "template": {
      "data": {
        "title": "",
        "author": "",
        "author_slug": "",
        "date": "",
        "pull_quote": "",
        "layout": "../_single.jade"
      },
      "content": "",
      "id": null
    },
    "name": "clicks",
    "content": [
      {
        "data": {
          "title": "Carrot Clicks: Our Week in Soshi, Stock Photos and Shia",
          "author": "Gabrielle",
          "author_slug": "gabrielle",
          "date": "2/14/2014",
          "layout": "../_single.jade"
        },
        "content": "![](https://carrot-blog.s3.amazonaws.com/uploads/img_1392402443698.png)\n\nOlympics. We're all supposed to be obsessed with talking about it, but we aren't. Instead we've [Shoshana'd][0] the games, set them to [90's music][1] and remixed them as [movie scenes][2]. The real competition is [flat vs. realistic design][3]. \n\nWe're pumped about Netflix's return of House of Cards and are celebrating with the co-branding genius that is [HouseofCardsAgainstHumanity][4]. An entire season of arguably the best show should help us get over the [death of Flappy Bird][5]. \n\nHappy Valentine's Day to those of you who got mad when I said HOC was \"the best\" and insulted your precious [Game of Thrones][6]. To celebrate, this guy is [picking up puppies][7] and Pizza Hut is looking for true love on [OkCupid][8]. And, the [Mile High Club][9] has just been made easier to enter. No need for sky-high romance? Check out Virgin America's [in-flight social network][10], powered by Linkedin.\n\n[Bonnaroo is coming to an xBox][11] near you, which means you can shower now... and listen to the tunes - perhaps on these new, [expertly-packaged][12] waterproof headphones. Don't worry, you can still grow out that festival beard and ask, \"[Will it beard][13]?\" \n\nBarbie is [\\#unapologetic][14] about her new Sports Illustrated cover. And Getty + LeanIn have partnered to create [empowering stock photography][15] (and just generally less lame photos). \n\nCaribou Coffee installed a [five-story tall Pinterest board][16] for their \\#CaribouInspires campaign. Target is creating collections based off of [top pinners][17]. At New York Fashion Week, Zac Posen matched [Spotify playlists][18] with each of his looks, and Tommy Hilfiger launched a [social, press concierge][19] for runway resources. \n\nGoogle has partnered with ComScore [for measurement][20]. Disney + Google Play have partnered for a [short film][21]. Google's DevArt project highlights those [using code to create IRL][22]. Delivery.com has called devs to improve their offering [using their API][23]. And Github launched an [education portal][24] to encourage universities to collaborate on code. \n\nNokia announced the launch of their [first Android phone][25]. Amazon launched \"[Flow][26],\" which recognizes objects in real life and finds them on the ecommerce platform for purchase. Meanwhile, Taco Bell introduced [mobile ordering][27]. \n\nWe learned that users prefer to [authorize applications][28] with Facebook. Instagram published a [book][29] full of tips for businesses, and a blog for them too ...[on tumblr.][30] And then Shia LaBeouf confused everyone all over again by [being sorry (and artsy)][31]. \n\nOh and [Comcast is buying Time Warner][32], which [affects ads][33]. [Twitter][34] and [Yelp!][35] redesigned. And Yahoo is going to display Yelp! reviews to help [increase search traffic][36]. \n\nStay warm, maybe dabble in some writing and [Hemingway that ish][37], and embrace [frostvertising][38]. \n\n[0]: http://shoshigames.tumblr.com/\n[1]: http://www.buzzfeed.com/ryanhatesthis/this-guys-been-making-vines-of-olympic-figure-skaters-dancin\n[2]: http://www.ebaumsworld.com/video/watch/83874906/\n[3]: http://www.flatvsrealism.com/\n[4]: http://www.houseofcardsagainsthumanity.com/\n[5]: http://www.ebay.com/sch/i.html?_odkw=flappy+bird&_osacat=0&_from=R40&_trksid=p2045573.m570.l1313.TR0.TRC0&_nkw=flappy+bird&_sacat=0%20http://jezebel.com/evgeni-plushenko-figure-skating-to-ginuwines-pony-is-1519977529?utm_campaign=socialflow_jezebel_facebook&utm_source=jezebel_facebook&utm_medium=socialflow\n[6]: http://www.inprnt.com/gallery/bishop/game-of-thrones-valentines/\n[7]: https://www.youtube.com/watch?v=7chevzRqWEg\n[8]: http://www.okcupid.com/pizzahut\n[9]: http://miscellaneousmischief.com/wingmanbeta.html\n[10]: http://www.boston.com/travel/explorene/blogs/packup/2014/02/virgin_america_launches_in_flight_social_network.html\n[11]: http://www.polygon.com/2014/2/6/5387722/bonnaroo-broadcast-xbox-360-one\n[12]: http://www.psfk.com/2014/02/sony-bottled-walkman-waterproof.html?utm_content=buffer8060b&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer#!u7IDB\n[13]: http://willitbeard.tumblr.com/\n[14]: http://www.adweek.com/news/press/sports-illustrated-swimsuit-issues-newest-model-barbie-155653?utm_source=Sailthru&utm_medium=email&utm_term=AWK_AdBrand&utm_campaign=Adweek%20Newsletter%20Template%20-%20Advertising%20%26%20Branding%20-%20July%2012\n[15]: http://www.nytimes.com/2014/02/10/business/leaninorg-and-getty-aim-to-change-womens-portrayal-in-stock-photos.html?hp\n[16]: http://www.adweek.com/adfreak/caribou-coffee-builds-five-story-tall-pinterest-board-mall-america-155674?utm_source=Sailthru&utm_medium=email&utm_term=AWK_NewDaily&utm_campaign=Adweek%20Newsletter%20Template%20-%20July%2012%20-%20Daily%20Digest\n[17]: http://www.fastcocreate.com/3026239/target-to-launch-collections-created-by-pinterests-top-pinners/\n[18]: http://www.psfk.com/2014/02/zac-posen-spotify-playlists.html?utm_source=Sailthru&utm_medium=email&utm_term=vertical_fashion&utm_campaign=vertical%20-%20Fashion%202014-02-10#!u6csM\n[19]: http://www.psfk.com/2014/02/tommy-hilfiger-social-concierge.html?utm_source=Sailthru&utm_medium=email&utm_term=daily&utm_campaign=Daily%202014-02-12#!vsw4u%20\n[20]: http://www.usatoday.com/story/tech/2014/02/10/google-comscore-advertising-deal/5291189/\n[21]: http://www.adweek.com/videowatch/disney-partners-google-distribute-original-short-film-155606\n[22]: http://www.psfk.com/2014/02/google-coding-art-project.html?utm_source=Sailthru&utm_medium=email&utm_term=daily&utm_campaign=Daily%202014-02-10#!u6ubX\n[23]: http://www.psfk.com/2014/02/delivery-com-developer-outreach.html?utm_source=Sailthru&utm_medium=email&utm_term=daily&utm_campaign=Daily%202014-02-11#!vfeS5\n[24]: http://thenextweb.com/insider/2014/02/11/github-wants-schools-collaborate-code/#!vsyyM\n[25]: http://online.wsj.com/news/article_email/SB10001424052702304104504579374893734151208-lMyQjAxMTA0MDAwNjEwNDYyWj\n[26]: http://www.psfk.com/2014/02/amazon-flow-object-scanning-app.html?utm_source=Sailthru&utm_medium=email&utm_term=vertical_retail&utm_campaign=vertical%20-%20Retail%202014-02-10#!u6bQx\n[27]: http://nrn.com/technology/taco-bell-offer-mobile-ordering-nationwide\n[28]: http://www.emarketer.com/Article/Users-lsquoLikersquo-Facebook-Social-Logins/1010601\n[29]: http://www.psfk.com/2014/02/instagram-brand-handbook.html?utm_source=Sailthru&utm_medium=email&utm_term=vertical_design&utm_campaign=vertical%20-%20Design%202014-02-12#!vr0mi\n[30]: http://sarahsfav.es/2014/02/10/instagrams-blog-for-business-launches-with-tools-tips-for-marketers-and-news-orgs/?utm_content=buffercb594&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer\n[31]: http://www.vice.com/read/shia-labeouf-is-currently-doing-some-kind-of-super-artsy-thing-in-los-angeles?utm_source=vicefbus\n[32]: http://www.bloomberg.com/news/2014-02-12/comcast-said-to-agree-to-pay-159-a-share-for-time-warner-cable.html\n[33]: http://adage.com/article/media/comcast-time-warner-cable-means-advertising/291713/\n[34]: http://mashable.com/2014/02/11/twitter-redesign-facebook-google/\n[35]: http://officialblog.yelp.com/2014/02/yelps-new-interface-in-your-face.html\n[36]: http://www.bloomberg.com/news/2014-02-09/yahoo-said-to-partner-with-yelp-to-attract-search-users.html\n[37]: http://www.hemingwayapp.com/\n[38]: http://www.brandflakesforbreakfast.com/2014/02/frostvertising-is-heating-up.html\n",
        "id": "clicks/2_14.md"
      },
      {
        "data": {
          "title": "Carrot Clicks: Our Week in Porn, Pranks and Payments",
          "author": "Gabrielle",
          "author_slug": "Gabrielle",
          "date": "2/21/14",
          "layout": "../_single.jade"
        },
        "content": "![](https://carrot-blog.s3.amazonaws.com/uploads/img_1393005677993.png)\n\nYou probably don't know anything in this week's Clicks because House of Cards debuted last Friday. Here's how Netflix [handled that][0]. If you live under a rock and celebrated Valentine's Day instead, maybe you saw Coke's [for-couples-only vending machines][1]. Speaking of which, Electrofunk band Chromeo revealed their latest album with a Craigslist [missed connection][2] post. \n\n**Cool shit this week: **Vans launched a documentary-based campaign that [celebrates its fans][3]. Barbie wrote [a sassy op-ed][4]. Bolthouse Farms is highlighting (_healthy_) [\\#foodporn][5]. Someone finally [deleted the \"equal\"][6] button on the calculator. DHL [pranked it's competitors][7] with temperature-rigged boxes in a Trojan mailing stunt. Neilsen's Report on the [US Digital Consumer][8] was issued (ok, so maybe that's more 'nerdy cool'). \n\nInstagram widgets have proved to [increase sales][9]. Instagram is the newest [flashmob location][10], according to Madewell. And, it's been scientifically proven that not all [selfies][11] are created equal. (And for a stretch... [Linkedin][12] has opened up long-form publishing to all users: _word-selfies_.) \n\nAirlines are getting social, in-flight: KLM is offering [social payments][13] for customers. Virgin is customizing customer service in flight with [Google Glass][14]. (Let's hope the flight attendants aren't \"Glassholes.\") Speaking of Google, they say Plus [isn't going anywhere][15] and they're launching a [contextually aware smartphone][16]. \n\nFacebook bought WhatsApp for [$19billion][17], and here are things that [don't cost that much][18]. Banking startup [Simple was acquired][19] for $117M by BBVA. And Shazam has partnered with Warner Music Group to [host their own record label][20]. \n\nUnicef turned phone detoxing [into clean water][21]. Everdayhero is [mapping people's charitable efforts][22] through their social posts. A new app allows you to leave [anonymous, geotagged][23] comments. Tumblr [redesigned their logo][24]. This design agency proposed a [new look for Wiki][25]. Apple is creating new headphones that allow for [integrated fitness tracking][26]. \n\nWearable technology? Nope; check out Coke's wearable [cure for technology][27] instead. Once you're wearing the cone, you won't be able to [navigate the Bates Motel][28], upload your food pics ([which over ⅓ of diners do][29]), or participate in Heineken's new foursquare-based [Champions League campaign][30]. But, at least you can still [drag and drop files with your eyes][31]. \n\nSee you next week. Make sure to finish HOC; someone is bound to ruin it for you sooner than later. \n\n[0]: http://www.marketplace.org/topics/business/what-happens-netflix-when-house-cards-goes-live\n[1]: http://designtaxi.com/news/363837/Coca-Cola-s-Invisible-Vending-Machine-Can-Only-Be-Seen-By-Couples/\n[2]: http://vrge.co/1f3UuGk\n[3]: http://www.adweek.com/adfreak/vans-celebrates-its-fans-and-their-lifestyles-incredible-documentary-series-155787?utm_source=Sailthru&utm_medium=email&utm_term=AW_Adfreak&utm_campaign=Adweek%20Newsletter%20Template%20-%20adfreak%20-%20july%2012\n[4]: http://www.barbiecollector.com/news/barbie-swimsuit-barbie-oped\n[5]: http://nyti.ms/1dOJUkO\n[6]: http://www.psfk.com/2014/02/equals-free-calculator.html#.UwOgRet7-b0.twitter\n[7]: http://designtaxi.com/news/363891/DHL-Pranks-Competitors-To-Advertise-For-Them/\n[8]: http://www.nielsen.com/us/en/reports/2014/the-us-digital-consumer-report.html\n[9]: http://digiday.com/brands/retailer-sales-instagrams/?utm_source=Sailthru&utm_medium=email&utm_term=Digiday%20Brands%20Newsletter&utm_campaign=DD%20Brands_final%20\n[10]: http://digiday.com/brands/madewell-tries-instagram-flash-mob/?utm_source=Sailthru&utm_medium=email&utm_term=Digiday%20Brands%20Newsletter&utm_campaign=DD%20Brands_final\n[11]: http://www.psfk.com/2014/02/selfie-trends-data-visualization.html?utm_source=Sailthru&O:10:%22Data=email&utm_term=daily&utm_campaign=Daily%202014-02-21#!wJr4Z\n[12]: http://mashable.com/2014/02/19/linkedin-publishing-all-users/\n[13]: http://www.psfk.com/2014/02/klm-airline-social-media-flight-payment.html?utm_source=Sailthru&utm_medium=email&utm_term=vertical_advertising&utm_campaign=vertical%20-%20Advertising%202014-02-18#!wkSQx\n[14]: http://www.psfk.com/2014/02/virgin-atlantic-conceirge-google-glass.html?utm_source=Sailthru&utm_medium=email&utm_term=daily&utm_campaign=Daily%202014-02-18#!wlFs3\n[15]: http://www.nytimes.com/2014/02/15/technology/the-plus-in-google-plus-its-mostly-for-google.html?_r=2\n[16]: http://techcrunch.com/2014/02/20/google-project-tango-smartphones-that-see/\n[17]: http://www.bloomberg.com/news/2014-02-19/facebook-to-buy-mobile-messaging-app-whatsapp-for-16-billion.html\n[18]: http://thingsthatarecheaperthanwhatsapp.tumblr.com/\n[19]: http://techcrunch.com/2014/02/20/simple-acquired-for-117m-will-continue-to-operate-separately-under-its-own-brand/?ncid=twittersocialshare%20\n[20]: http://thenextweb.com/insider/2014/02/19/shazam-branded-label-way-thanks-warner-music-group-deal/#!wCZKC\n[21]: http://www.psfk.com/2014/02/unicef-phone-detox-tap-project.html?utm_source=Sailthru&utm_medium=email&utm_term=daily&utm_campaign=Daily%202014-02-20#!wCxky\n[22]: http://www.psfk.com/2014/02/charitable-giving-web-calculator.html?utm_source=Sailthru&utm_medium=email&utm_term=vertical_design&utm_campaign=vertical%20-%20Design%202014-02-19#!wuedR\n[23]: http://www.psfk.com/2014/02/anonymous-confessions-app.html?utm_source=Sailthru&utm_medium=email&utm_term=daily&utm_campaign=Daily%202014-02-20#!wDzaM\n[24]: http://designtaxi.com/news/363830/Tumblr-s-Logo-Gets-A-Subtle-Tweak/\n[25]: http://www.psfk.com/2014/02/wikipedia-design-layout-change.html?utm_source=Sailthru&utm_medium=email&utm_term=vertical_design&utm_campaign=vertical%20-%20Design%202014-02-19#!wueuH\n[26]: http://techcrunch.com/2014/02/18/apple-patents-headphones-with-integrated-activity-health-and-fitness-tracking/\n[27]: http://www.psfk.com/2014/02/dog-cone-social-media-addiction-cure.html?utm_source=Sailthru&O:10:%22Data=email&utm_term=daily&utm_campaign=Daily%202014-02-21#!wJr4B\n[28]: http://www.psfk.com/2014/02/iphone-flashlight-website-controller.html?utm_source=Sailthru&utm_medium=email&utm_term=daily&utm_campaign=Daily%202014-02-18#!wlGp0\n[29]: http://www.telegraph.co.uk/technology/news/10638378/Over-a-third-of-diners-upload-photos-to-social-profiles-while-in-restaurants.html\n[30]: http://www.adweek.com/news/advertising-branding/heineken-turns-foursquare-branded-mobile-app-usage-wanes-155769%20%20%20%20\n[31]: http://www.psfk.com/2014/02/drag-files-eyes.html?utm_source=Sailthru&utm_medium=email&utm_term=daily&utm_campaign=Daily%202014-02-19#!wuIsl",
        "id": "clicks/2_21_14.md"
      },
      {
        "data": {
          "title": "Carrot Clicks: Our Week in Waffles, Milk and McDonald's",
          "author": "Gabrielle",
          "author_slug": "gabrielle",
          "date": "2/28/14",
          "layout": "../_single.jade"
        },
        "content": "![](https://carrot-blog.s3.amazonaws.com/uploads/img_1393606817570.png)\n\nMeet NYC's [most desired][0] OKCupid prospects. The only thing more popular will be Taco Bell's new [Waffle Taco][1]. Holy [House of Carbs][2], _amiriiiight?_ \n\nThe newly acquired WhatsApp announced that it will be [offering voice calls][3], while [MovieFone][4] is nixing their phone system and going digital. Other things that are going RIP: [Facebook email][5], \"[Got Milk,][6]\" and marketing emails (actually, Google is just making it way [easier to unsubscribe][7] without scrolling to the tiny text). Oh, and kids are trading [toys for touch][8] (screens). \n\nAdvertising got aggressive this week. Boxer Klitschko [punched letters][9] to create a font you can purchase on ebay for charity, and posters [featuring gunpowder][10] popped up. If that got you all riled up, check out this [guided meditation][11]. \n\nIn publishing: [FWx launched][12] for foodie millenials; 'Watch' magazine created a custom violin soundtrack for their online pub; ESPN launched [15 conference channels][13] on Apple TV; [Disney launched an app][14] that lets you watch all of their movies; [Amazon launched original programming][15] with a single ad sponsor; And, Reddit is having a [news vs. moderator][16] crisis. (This [social media lie detector][17] - in development -could help them judge real time information against rumors and spam.) \n\n[Looky.co][18] is is new online marketplace where you sell to people you're socially connected to or physically near. [Free People][19] is featuring real consumer pics on their site to show off merch. \\#saksinsix launched to give Viners [beauty tutorials][20]; which could come in handy for those using the new app TicketLeap that uses the ever-popular [selfie to grant admission to events][21]. Speaking of events, research shows that [our tweets get shorter][22] when we're live-tweeting. \n\nTwitter/Vine integrations [coming to movie screens][23]. Resumes are turning into [tumblr GIFs][24]. McDonald's [is on Snapchat][25]. And there is now [image recognition tech][26] for Google Glass. Related: at London Fashion week, [Top Shop][27] invited fans to enjoy a virtual reality version of their show... wearing headgear way less fashionable than Glass. \n\nFacebook made [some of the best platform ads][28] (_not biased or anything_), but they don't intend on running them. They're also [moving into NYC][29], released \"[highlights][30]\" on mobile, and changed their news feed algorithm to [increase brand visibility][31]. Twitter also made changes for brand visibility ensuring that promoted accounts [appear at the top of search results][32]. \n\nAnd in news of people we like: [VICE news][33] is opening up spots in beta (get one); Prolific launched [Threadless' new iphone app][34], and [Dash just got another round of funding][35] in time for their app update. **\\#carrotfamily **\n\n\n[0]: http://nymag.com/thecut/2014/02/okcupid-most-desired-people-in-new-york.html?mid=facebook_nymag\n[1]: http://gothamist.com/2014/02/24/taco_bell_bursts_onto_fast_food_bre.php#photo-1\n[2]: http://houseofcarbs.tumblr.com/\n[3]: http://venturebeat.com/2014/02/24/whatsapps-killer-upcoming-feature-phone-calls/\n[4]: http://www.hollywoodreporter.com/news/moviefone-hanging-up-going-all-682729\n[5]: http://recode.net/2014/02/24/the-great-facebook-email-experiment-is-over/\n[6]: http://www.latimes.com/business/money/la-fi-mo-got-milk-campaign-20140224,0,126531.story#axzz2uLWk03jI\n[7]: http://www.pcworld.com/article/2100020/gmails-unsubscribe-tool-comes-out-of-the-weeds.html\n[8]: http://www.dailymail.co.uk/sciencetech/article-2565061/How-iPad-replaced-toy-chest-Researchers-children-play-touchscreens-traditional-toys.html\n[9]: http://designtaxi.com/news/363946/Champion-Boxer-Literally-Punches-Out-A-New-Typeface-Fights-Illiteracy/\n[10]: http://www.psfk.com/2014/02/gunpowder-ink-exploding-ads.html?utm_source=Sailthru&utm_medium=email&utm_term=daily&utm_campaign=Daily%202014-02-25#!xwgOR\n[11]: http://www.calm.com/\n[12]: http://www.adweek.com/news/press/food-wine-launches-new-brand-millennials-155939\n[13]: http://variety.com/2014/digital/news/espn-launches-15-college-conference-channels-on-apple-tv-roku-exclusive-1201122302/\n[14]: http://techcrunch.com/2014/02/25/disney-movies-anywhere/?ncid=rss\n[15]: http://adage.com/article/digital/amazon-launches-video-ad-business-geico/291779/\n[16]: http://gigaom.com/2014/02/27/reddit-is-having-the-same-problem-as-traditional-media-defining-what-the-news-is/?curator=MediaREDEF\n[17]: http://www.bbc.co.uk/news/technology-26263510\n[18]: http://www.psfk.com/2014/02/community-based-craigslist.html?utm_source=Sailthru&utm_medium=email&utm_term=daily&utm_campaign=Daily%202014-02-25#!xwgKt\n[19]: http://www.psfk.com/2014/02/free-people-customer-models.html?utm_source=Sailthru&utm_medium=email&utm_term=vertical_advertising&utm_campaign=vertical%20-%20Advertising%202014-02-25#!xx5Ys\n[20]: http://www.luxurydaily.com/saks-downsizes-beauty-tutorials-via-vine-to-attract-busy-consumers/\n[21]: http://news.cnet.com/8301-17852_3-57619247-71/finally-an-actual-use-for-a-selfie/?part=rss&subj=crave&tag=title\n[22]: http://web.mit.edu/newsoffice/2014/social-medias-law-of-short-messages-0226.html\n[23]: http://variety.com/2014/digital/news/coming-soon-tweets-vines-set-to-play-on-u-s-movie-screens-this-summer-1201118428/\n[24]: http://thegifresume.tumblr.com/\n[25]: http://adage.com/article/digital/mcdonald-s-joins-marketers-experimenting-snapchat/291875/\n[26]: http://blogs.wsj.com/digits/2014/02/26/how-advertisers-might-grab-you-through-google-glass/\n[27]: http://www.stylebubble.co.uk/style_bubble/2014/02/topshops-virtual-reality.html%20\n[28]: http://mashable.com/2014/02/27/facebook-ad-ski-couch/\n[29]: http://www.psfk.com/2014/02/facebook-frank-gehry-new-york-office.html?utm_source=Sailthru&utm_medium=email&utm_term=daily&utm_campaign=Daily%202014-02-26#!xBvfB\n[30]: http://techcrunch.com/2014/02/21/facebook-highlights/\n[31]: http://socialnewsdaily.com/24926/facebook-gives-brands-more-news-feed-exposure/%20\n[32]: http://mashable.com/2014/02/25/twitter-promoted-accounts-search-results/\n[33]: https://news.vice.com/\n[34]: http://prolificinteractive.com/threadless/\n[35]: http://techcrunch.com/2014/02/27/964641/",
        "id": "clicks/2_28_14.md"
      }
    ]
  }
]
